fQwQf/A20OS/kernel/drivers/stm32f1/bluetooth.c
        size_t pos = i + j;
        while (response[pos] == ':' || response[pos] == '=' ||
               response[pos] == '"' || response[pos] == ' ')
            pos++;
        size_t out = 0;
        while (response[pos] && response[pos] != '\r' &&
               response[pos] != '\n' && response[pos] != '"' &&
               out + 1U < capacity)
            value[out++] = response[pos++];
        value[out] = '\0';
        return out != 0;
    }
    return 0;
}

static int bluetooth_at_exchange(const char *command, char *response,
                                 size_t capacity, unsigned timeout_ms,
                                 int key_mode) {
    if (!command || !response || capacity < 2U)
        return -1;

    if (key_mode == STM32_BLUETOOTH_AT_KEY_LOW) {
        bluetooth_key_set(0);
    } else {
        bluetooth_key_set(1);
        bluetooth_delay_ms(BLUETOOTH_KEY_SETUP_MS);
    }
    bluetooth.at_attempts++;
    response[0] = '\0';
    bluetooth_uart_flush();
    for (size_t i = 0; command[i]; i++) {
        if (bluetooth_uart_send_byte((uint8_t)command[i]) != 0) {
            if (key_mode == STM32_BLUETOOTH_AT_KEY_PULSE)
                bluetooth_key_set(0);
            return -1;
        }
    }
    if (stm32_uart_wait_tx_complete(
            BLUETOOTH_UART, BLUETOOTH_TX_TIMEOUT) != 0) {
        if (key_mode == STM32_BLUETOOTH_AT_KEY_PULSE)
            bluetooth_key_set(0);
        return -1;
    }
    /* The supplied PZ-HC05 driver drops KEY immediately after transmission. */
    if (key_mode == STM32_BLUETOOTH_AT_KEY_PULSE)
        bluetooth_key_set(0);

    size_t length = 0;
    uint32_t error_bytes = 0;
    /*
     * Read the reply with a tight cycle-counter spin-poll. At 38400 baud a byte
     * lands every ~260us and the F103 USART has no RX FIFO, so the previous
     * 1ms-granularity poll overran and truncated "OK\r\n" to "O", making a
     * responding module look unconfigured. Poll continuously, end the frame
     * after a short inter-byte idle, and bound the wait by timeout_ms.
     */
    CORE_DEMCR |= CORE_DEMCR_TRCENA;
    DWT_CTRL |= DWT_CTRL_CYCCNTENA;
    uint32_t hclk = stm32_hclk_hz();
    uint32_t idle_cycles = hclk / 500U;   /* ~2 ms of silence ends the frame */
    uint32_t timeout_cycles = (uint32_t)(((uint64_t)hclk * timeout_ms) / 1000U);
    uint32_t start = DWT_CYCCNT;
    uint32_t last_activity = start;
    uint32_t guard = 0;
    for (;;) {
        uint8_t value;
        int result = stm32_uart_poll_byte(BLUETOOTH_UART, &value);
        if (result > 0) {
            bluetooth.at_received_bytes++;
            if (length + 1U < capacity)
                response[length++] = (char)value;
            last_activity = DWT_CYCCNT;
        } else if (result < 0) {
            error_bytes++;
            bluetooth.at_error_bytes++;
            last_activity = DWT_CYCCNT;
        }
        uint32_t now = DWT_CYCCNT;
        if (length != 0U && (uint32_t)(now - last_activity) >= idle_cycles)
            break;
        if ((uint32_t)(now - start) >= timeout_cycles)
            break;
        if (++guard >= 3000000U)   /* backstop if the cycle counter ever stalls */
            break;
    }
    response[length] = '\0';
    bluetooth_log_response(command, response, length,
                           key_mode, error_bytes);
    return bluetooth_response_contains(response, "OK") ? 0 : -1;
}

static int bluetooth_at_command(const char *command, char *response,
                                size_t capacity) {
    for (unsigned attempt = 0; attempt < BLUETOOTH_AT_RETRIES; attempt++) {
        if (bluetooth_at_exchange(command, response, capacity,
                                  BLUETOOTH_AT_TIMEOUT_MS,
                                  bluetooth_at_key_mode) == 0)
            return 0;
        bluetooth_delay_ms(20U);
    }
    return -1;
}

static int bluetooth_reset_to_data_mode(char *response, size_t capacity) {
    static const char reset_command[] = "AT+RESET\r\n";

    if (!response || capacity < 2U)
        return -1;

    if (bluetooth_at_key_mode != STM32_BLUETOOTH_AT_KEY_LOW) {
        bluetooth_key_set(1);
        bluetooth_delay_ms(10U);
    } else {
        bluetooth_key_set(0);
    }
    bluetooth_uart_flush();
    for (size_t i = 0; reset_command[i]; i++) {
        if (bluetooth_uart_send_byte((uint8_t)reset_command[i]) != 0) {
            bluetooth_key_set(0);
            return -1;
        }
    }

    /*
     * KEY must be low when the module performs its software reset. Keeping
     * it high here boots standard HC-05 firmware straight back into full AT
     * mode, where phones cannot discover it.
     */
    if (stm32_uart_wait_tx_complete(
            BLUETOOTH_UART, BLUETOOTH_TX_TIMEOUT) != 0) {
        bluetooth_key_set(0);
        return -1;
    }
    bluetooth_key_set(0);

    size_t length = 0;
    unsigned idle_ms = 0;
    for (unsigned waited = 0; waited < BLUETOOTH_AT_TIMEOUT_MS; waited++) {
        int received = 0;
        for (;;) {
            uint8_t value;
            int result = stm32_uart_poll_byte(
                BLUETOOTH_UART, &value);
            if (result == 0)
                break;
            if (result < 0)
                continue;
            received = 1;
            if (length + 1U < capacity)
                response[length++] = (char)value;
        }
        if (received)
            idle_ms = 0;
        else if (length != 0 && ++idle_ms >= 20U)
            break;
        bluetooth_delay_ms(1U);
    }
    response[length] = '\0';

    /*
     * Some firmware resets before transmitting OK. The command was sent on
     * an already verified AT link, so silence is acceptable; an explicit
     * ERROR is not.
     */
    return bluetooth_response_contains(response, "ERROR") ? -1 : 0;
}

static int bluetooth_find_at_baud(char *response, size_t capacity) {
    /*
     * The HC-05 on this board is fixed at 38400 (STM32_BT_BAUD), so probe that
     * baud only instead of sweeping every rate — the multi-baud scan just
     * stalled boot for seconds while every wrong rate returned nothing.
     */
    static const uint32_t baud_rates[] = {
        BLUETOOTH_BAUD_RATE,
    };

