fQwQf/A20OS/kernel/drivers/stm32f1/bluetooth.c
    for (unsigned i = 0; i < sizeof(baud_rates) / sizeof(baud_rates[0]);
         i++) {
        bluetooth_uart_set_baud(baud_rates[i]);
        bluetooth_delay_ms(20U);
        if (bluetooth_at_exchange("AT\r\n", response, capacity,
                                  BLUETOOTH_AT_PROBE_TIMEOUT_MS,
                                  STM32_BLUETOOTH_AT_KEY_HIGH) == 0) {
            bluetooth_at_key_mode = STM32_BLUETOOTH_AT_KEY_HIGH;
            return (int)baud_rates[i];
        }
        for (unsigned attempt = 0; attempt < BLUETOOTH_AT_RETRIES; attempt++) {
            if (bluetooth_at_exchange("AT\r\n", response, capacity,
                                      BLUETOOTH_AT_PROBE_TIMEOUT_MS,
                                      STM32_BLUETOOTH_AT_KEY_PULSE) == 0) {
                bluetooth_at_key_mode = STM32_BLUETOOTH_AT_KEY_PULSE;
                return (int)baud_rates[i];
            }
            bluetooth_delay_ms(20U);
        }
    }
    return -1;
}

static int bluetooth_enter_at_mode(char *response, size_t capacity,
                                   uint32_t *at_baud) {
    /*
     * The supplied PZ-HC05 example enters command mode at the transparent-data
     * baud by pulsing KEY around each command. Try that path first. It works
     * after both a power cycle and a debugger-only MCU reset.
     */
    bluetooth_key_set(1);
    bluetooth_uart_set_baud(BLUETOOTH_BAUD_RATE);
    bluetooth_delay_ms(20U);
    if (bluetooth_at_exchange("AT\r\n", response, capacity,
                              BLUETOOTH_AT_PROBE_TIMEOUT_MS,
                              STM32_BLUETOOTH_AT_KEY_HIGH) == 0) {
        bluetooth_at_key_mode = STM32_BLUETOOTH_AT_KEY_HIGH;
        bluetooth.at_key_mode = bluetooth_at_key_mode;
        bluetooth.at_pulse_mode = 0;
        bluetooth.at_power_on_mode = 0;
        *at_baud = BLUETOOTH_BAUD_RATE;
        return 0;
    }
    bluetooth_key_set(0);

    int baud = bluetooth_find_at_baud(response, capacity);
    if (baud >= 0) {
        bluetooth.at_key_mode = bluetooth_at_key_mode;
        bluetooth.at_pulse_mode =
            bluetooth_at_key_mode == STM32_BLUETOOTH_AT_KEY_PULSE;
        bluetooth.at_power_on_mode =
            bluetooth_at_key_mode == STM32_BLUETOOTH_AT_KEY_HIGH &&
            baud == 38400;
        *at_baud = (uint32_t)baud;
        return 0;
    }
    return -1;
}

static int bluetooth_set_and_verify(const char *set_command,
                                    const char *query_command,
                                    const char *key,
                                    const char *expected,
                                    char *response, size_t capacity) {
    char value[40];

    if (bluetooth_at_command(set_command, response, capacity) != 0)
        return 0;
    if (bluetooth_at_command(query_command, response, capacity) != 0)
        return 0;
    if (!bluetooth_response_value(response, key, value, sizeof(value)))
        return 0;
    return bluetooth_text_equal(value, expected);
}

static int bluetooth_set_pin(char *response, size_t capacity) {
    static const char pin_set[] =
        "AT+PSWD=" STM32_BLUETOOTH_PIN "\r\n";
    static const char pin_set_quoted[] =
        "AT+PSWD=\"" STM32_BLUETOOTH_PIN "\"\r\n";
    char pin[sizeof(bluetooth.pin)];

    if (bluetooth_at_command(pin_set, response, capacity) == 0 &&
        bluetooth_at_command("AT+PSWD?\r\n", response, capacity) == 0 &&
        bluetooth_response_value(response, "PSWD", pin, sizeof(pin))) {
        bluetooth_copy_text(bluetooth.pin, sizeof(bluetooth.pin), pin);
        if (bluetooth_text_equal(pin, STM32_BLUETOOTH_PIN))
            return 1;
    }

    /*
     * The second supplied example deliberately retries with quotes because
     * several HC-05 clone firmwares acknowledge the unquoted form without
     * actually changing the PIN.
     */
    if (bluetooth_at_command(pin_set_quoted, response, capacity) != 0 ||
        bluetooth_at_command("AT+PSWD?\r\n", response, capacity) != 0 ||
        !bluetooth_response_value(response, "PSWD", pin, sizeof(pin)))
        return 0;
    bluetooth_copy_text(bluetooth.pin, sizeof(bluetooth.pin), pin);
    return bluetooth_text_equal(pin, STM32_BLUETOOTH_PIN);
}

static int bluetooth_set_name(char *response, size_t capacity) {
    static const char name_set[] =
        "AT+NAME=" STM32_BLUETOOTH_DEVICE_NAME "\r\n";
    char name[sizeof(bluetooth.device_name)];

    if (bluetooth_at_command(name_set, response, capacity) != 0 ||
        bluetooth_at_command("AT+NAME?\r\n", response, capacity) != 0 ||
        !bluetooth_response_value(response, "NAME", name, sizeof(name)))
        return 0;
    bluetooth_copy_text(bluetooth.device_name,
                        sizeof(bluetooth.device_name), name);
    return bluetooth_text_equal(name, STM32_BLUETOOTH_DEVICE_NAME);
}

static void bluetooth_configure_uuid(char *response, size_t capacity) {
    static const char uuid_set[] =
        "AT+UUID=" STM32_BLUETOOTH_SERVICE_UUID_TEXT "\r\n";
    char uuid_text[16];
    int valid = 0;

    bluetooth.service_uuid = 0;
    bluetooth.uuid_supported = 0;
    bluetooth.uuid_configured = 0;
    if (bluetooth_at_command(uuid_set, response, capacity) != 0) {
        bluetooth.service_uuid = 0x1101U;
        return;
    }
    bluetooth.uuid_supported = 1;
    if (bluetooth_at_command("AT+UUID?\r\n", response, capacity) != 0 ||
        !bluetooth_response_value(response, "UUID",
                                  uuid_text, sizeof(uuid_text)))
        return;
    uint16_t uuid = bluetooth_parse_uuid(uuid_text, &valid);
    if (!valid)
        return;
    bluetooth.service_uuid = uuid;
    bluetooth.uuid_configured = uuid == bluetooth.requested_uuid;
}

static int bluetooth_set_uart(uint32_t at_baud, char *response,
                              size_t capacity) {
    static const char uart_set[] =
        "AT+UART=" STM32_BLUETOOTH_BAUD_RATE_TEXT ",0,0\r\n";
    static const char uart_expected[] =
        STM32_BLUETOOTH_BAUD_RATE_TEXT ",0,0";
    char value[40];

    if (bluetooth_at_command(uart_set, response, capacity) != 0)
        return 0;
    if (bluetooth_at_command("AT+UART?\r\n", response, capacity) == 0 &&
        bluetooth_response_value(response, "UART", value, sizeof(value)) &&
        bluetooth_text_equal(value, uart_expected))
        return 1;

    bluetooth_uart_set_baud(BLUETOOTH_BAUD_RATE);
    if (bluetooth_at_command("AT+UART?\r\n", response, capacity) == 0) {
        if (bluetooth_response_value(
                response, "UART", value, sizeof(value)) &&
            bluetooth_text_equal(value, uart_expected))
            return 1;
    }
    bluetooth_uart_set_baud(at_baud);
    return 0;
}

static int bluetooth_configure(void) {
    char response[BLUETOOTH_AT_RESPONSE_MAX];

