fQwQf/A20OS/kernel/drivers/stm32f1/bluetooth.c
    bluetooth.at_responsive = 0;
    bluetooth.configured = 0;
    bluetooth.waiting = 0;
    bluetooth.slave_mode = 0;
    bluetooth.discoverable = 0;
    bluetooth.name_configured = 0;
    bluetooth.pin_configured = 0;
    bluetooth.uuid_supported = 0;
    bluetooth.uuid_configured = 0;
    bluetooth.reset_performed = 0;
    bluetooth.at_baud_rate = 0;
    bluetooth.service_uuid = 0;
    bluetooth.device_name[0] = '\0';
    bluetooth.pin[0] = '\0';
    bluetooth.address[0] = '\0';

    uint32_t at_baud = 0;
    bluetooth_at_key_mode = STM32_BLUETOOTH_AT_KEY_PULSE;
    if (bluetooth_enter_at_mode(response, sizeof(response),
                                &at_baud) != 0) {
        bluetooth.detected = 0;
        bluetooth_uart_set_baud(BLUETOOTH_BAUD_RATE);
        bluetooth_key_set(0);
        return -1;
    }
    bluetooth.at_responsive = 1;
    bluetooth.at_baud_rate = at_baud;

    char role[8];
    if (bluetooth_at_command("AT+ROLE?\r\n", response,
                             sizeof(response)) != 0 ||
        !bluetooth_response_value(response, "ROLE", role, sizeof(role))) {
        /* ESP8266 also answers plain AT; ROLE is the HC-05 discriminator. */
        bluetooth.at_responsive = 0;
        bluetooth.detected = 0;
        bluetooth_key_set(0);
        bluetooth_uart_set_baud(BLUETOOTH_BAUD_RATE);
        return -1;
    }
    bluetooth.detected = 1;

    bluetooth.slave_mode = bluetooth_set_and_verify(
        "AT+ROLE=0\r\n", "AT+ROLE?\r\n", "ROLE", "0",
        response, sizeof(response));
    bluetooth.discoverable = bluetooth_set_and_verify(
        "AT+CMODE=1\r\n", "AT+CMODE?\r\n", "CMODE", "1",
        response, sizeof(response));
    bluetooth.name_configured =
        bluetooth_set_name(response, sizeof(response));

    bluetooth.pin_configured =
        bluetooth_set_pin(response, sizeof(response));
    if (bluetooth_at_command("AT+ADDR?\r\n", response,
                             sizeof(response)) == 0)
        (void)bluetooth_response_value(
            response, "ADDR", bluetooth.address,
            sizeof(bluetooth.address));

    bluetooth_configure_uuid(response, sizeof(response));
    int uart_configured =
        bluetooth_set_uart(at_baud, response, sizeof(response));
    int base_configured =
        bluetooth.slave_mode && bluetooth.discoverable &&
        bluetooth.name_configured && bluetooth.pin_configured &&
        uart_configured;
    int uuid_satisfied =
        bluetooth.uuid_configured ||
        (!bluetooth.uuid_supported && bluetooth.requested_uuid == 0x1101U);
    bluetooth.configured = base_configured && uuid_satisfied;

    /*
     * Always leave command mode, even when a vendor firmware fails one of
     * the read-back checks. Otherwise the module remains undiscoverable and
     * looks physically absent.
     */
    if (bluetooth_reset_to_data_mode(response, sizeof(response)) == 0)
        bluetooth.reset_performed = 1;
    bluetooth_uart_set_baud(BLUETOOTH_BAUD_RATE);
    bluetooth_uart_flush();
    if (bluetooth.reset_performed)
        bluetooth_delay_ms(BLUETOOTH_RESET_DELAY_MS);
    bluetooth.waiting = base_configured && bluetooth.reset_performed;
    return bluetooth.waiting ? 0 : -1;
}

static void gpio_config_pin(volatile uint32_t *crl, volatile uint32_t *crh,
                            unsigned pin, uint32_t mode) {
    volatile uint32_t *reg = pin < 8U ? crl : crh;
    uint32_t shift = (pin & 7U) * 4U;
    uint32_t value = *reg;
    value &= ~(0xFU << shift);
    value |= mode << shift;
    *reg = value;
}
#endif

static int bluetooth_buffer_has_newline(void) {
    unsigned tail = bluetooth_rx_tail;

    while (tail != bluetooth_rx_head) {
        if (bluetooth_rx[tail] == '\n')
            return 1;
        tail = (tail + 1U) % BLUETOOTH_RX_SIZE;
    }
    return 0;
}

void stm32_bluetooth_early_key_init(void) {
#ifdef CONFIG_STM32_XUANWU
    RCC_APB2ENR |= RCC_APB2ENR_IOPAEN;
    gpio_config_pin(&GPIOA_CRL, &GPIOA_CRH, BLUETOOTH_KEY_PIN, 0x3U);
    GPIOA_BRR = 1U << BLUETOOTH_KEY_PIN;
#endif
}

int stm32_bluetooth_init(void) {
    bluetooth.ready = 0;
    bluetooth.detected = 0;
    bluetooth.at_responsive = 0;
    bluetooth.at_pulse_mode = 0;
    bluetooth.at_power_on_mode = 0;
    bluetooth.at_key_mode = STM32_BLUETOOTH_AT_KEY_LOW;
    bluetooth.configured = 0;
    bluetooth.connected = 0;
    bluetooth.waiting = 0;
    bluetooth.slave_mode = 0;
    bluetooth.discoverable = 0;
    bluetooth.name_configured = 0;
    bluetooth.pin_configured = 0;
    bluetooth.uuid_supported = 0;
    bluetooth.uuid_configured = 0;
    bluetooth.reset_performed = 0;
    bluetooth.rx_line_state = STM32_BLUETOOTH_RX_UNKNOWN;
    bluetooth.baud_rate = BLUETOOTH_BAUD_RATE;
    bluetooth.at_baud_rate = 0;
    bluetooth.service_uuid = 0;
    bluetooth.requested_uuid = STM32_BLUETOOTH_SERVICE_UUID;
    bluetooth.received_bytes = 0;
    bluetooth.transmitted_bytes = 0;
    bluetooth.dropped_bytes = 0;
    bluetooth.at_received_bytes = 0;
    bluetooth.at_error_bytes = 0;
    bluetooth.at_attempts = 0;
    bluetooth.device_name[0] = '\0';
    bluetooth.pin[0] = '\0';
    bluetooth.address[0] = '\0';
    bluetooth_rx_head = 0;
    bluetooth_rx_tail = 0;
    bluetooth_frame_ready = 0;
    bluetooth_observed_rx = 0;
    bluetooth_last_rx_time = 0;
    bluetooth_state_changed_time = 0;
    bluetooth_state_high = 0;
    bluetooth_at_key_mode = STM32_BLUETOOTH_AT_KEY_LOW;
    bluetooth_uart_baud = 0;

#ifndef CONFIG_STM32_XUANWU
    return -1;
#else
    RCC_APB2ENR |= RCC_APB2ENR_AFIOEN | RCC_APB2ENR_IOPAEN |
                   RCC_APB2ENR_IOPBEN;
    stm32_bluetooth_early_key_init();

    /*
     * PA15 carries HC-05 STATE on Xuanwu, so retain SWD but release the
     * JTAG-only pins before configuring it as an input.
     */
    AFIO_MAPR = (AFIO_MAPR & ~AFIO_MAPR_SWJ_CFG_MASK) |
                AFIO_MAPR_SWJ_NOJTAG;

    gpio_config_pin(&GPIOA_CRL, &GPIOA_CRH, BLUETOOTH_KEY_PIN, 0x3U);
    gpio_config_pin(&GPIOA_CRL, &GPIOA_CRH, BLUETOOTH_STATE_PIN, 0x8U);
    /*
     * Probe the module TX path while KEY is low. The PZ-HC05 board drives
     * TX through a Schottky level-shift network with pull-ups on both sides;
     * leaving ATSET high while probing can make an otherwise connected path
     * look floating.
     */
    bluetooth_delay_ms(20U);
    bluetooth.rx_line_state = bluetooth_probe_rx_line();
    bluetooth.detected =
        bluetooth_rx_line_is_present(bluetooth.rx_line_state);

