fQwQf/A20OS/kernel/drivers/stm32f1/bluetooth.c
    GPIOA_BSRR = 1U << BLUETOOTH_STATE_PIN;

    if (stm32_uart_init(BLUETOOTH_UART, BLUETOOTH_BAUD_RATE, 0) != 0)
        return -1;
    bluetooth_uart_baud = BLUETOOTH_BAUD_RATE;
    bluetooth_delay_ms(BLUETOOTH_BOOT_DELAY_MS);

    /*
     * Re-probe after the module boot delay. Some HC-05 modules do not drive
     * their TX pin until they have finished their own power-on sequence, so an
     * early probe can report floating even when the module is wired correctly.
     */
    bluetooth.rx_line_state = bluetooth_probe_rx_line();
    bluetooth.detected =
        bluetooth_rx_line_is_present(bluetooth.rx_line_state) ||
        bluetooth.detected;

    /*
     * When the module never drives USART3 RX after its power-on delay there is
     * no HC-05 answering, so the exhaustive multi-baud AT scan cannot receive a
     * single byte: the extra retry rounds only stall boot (tens of seconds) and
     * flood the console without changing the outcome (ready stays 0). Scan once
     * in that case. A module whose TX line is driven keeps the full retry
     * budget for robust auto-baud detection, and even the single fallback scan
     * is a complete 6-baud sweep, so a genuinely present module is never missed.
     */
    unsigned init_retries = bluetooth.detected ? BLUETOOTH_INIT_RETRIES : 0U;
    int configured = 0;
    for (unsigned attempt = 0; attempt <= init_retries; attempt++) {
        configured = bluetooth_configure() == 0;
        if (configured)
            break;
        if (attempt < init_retries) {
            printf("[BT] configuration attempt %u failed, retrying in %u ms\n",
                   attempt + 1U,
                   (unsigned)BLUETOOTH_INIT_RETRY_DELAY_MS);
            bluetooth_key_set(0);
            stm32_uart_set_rx_irq(STM32_UART_USART3, 0);
            bluetooth_uart_set_baud(BLUETOOTH_BAUD_RATE);
            bluetooth_uart_flush();
            bluetooth_delay_ms(BLUETOOTH_INIT_RETRY_DELAY_MS);
        }
    }

    bluetooth.connected = 0;
    bluetooth_state_high =
        (bluetooth.detected || bluetooth.at_responsive) &&
        !!(GPIOA_IDR & (1U << BLUETOOTH_STATE_PIN));
    /* Keep the interface armed even when the optional module does not reply. */
    bluetooth.ready = 1;
    bluetooth.waiting = configured;
    stm32_uart_set_rx_irq(BLUETOOTH_UART, 1);
    return configured ? 0 : -1;
#endif
}

int stm32_bluetooth_reprobe(void) {
#ifndef CONFIG_STM32_XUANWU
    return -1;
#else
    if (bluetooth.connected)
        return 0;

    bluetooth_key_set(0);
    bluetooth_delay_ms(20U);
    bluetooth.rx_line_state = bluetooth_probe_rx_line();
    bluetooth.detected =
        bluetooth_rx_line_is_present(bluetooth.rx_line_state);
    stm32_uart_set_rx_irq(BLUETOOTH_UART, 0);
    bluetooth_uart_set_baud(BLUETOOTH_BAUD_RATE);
    bluetooth_key_set(0);
    bluetooth_delay_ms(20U);
    int configured = bluetooth_configure() == 0;
    bluetooth.ready = 1;
    bluetooth.waiting = configured;
    bluetooth.connected = 0;
    bluetooth_state_high =
        (bluetooth.detected || bluetooth.at_responsive) &&
        !!(GPIOA_IDR & (1U << BLUETOOTH_STATE_PIN));
    bluetooth_state_changed_time = 0;
    stm32_uart_set_rx_irq(BLUETOOTH_UART, bluetooth.ready);
    return configured ? 0 : -1;
#endif
}

void stm32_bluetooth_irq(void) {
    if (!bluetooth.ready)
        return;

    for (;;) {
        uint8_t value;
        int result = stm32_uart_poll_byte(BLUETOOTH_UART, &value);
        if (result == 0)
            break;
        if (result < 0) {
            bluetooth.dropped_bytes++;
            continue;
        }

        unsigned next = (bluetooth_rx_head + 1U) % BLUETOOTH_RX_SIZE;
        if (next == bluetooth_rx_tail) {
            bluetooth.dropped_bytes++;
            continue;
        }
        bluetooth_rx[bluetooth_rx_head] = value;
        bluetooth_rx_head = next;
        bluetooth.received_bytes++;
        if (value == '\n')
            bluetooth_frame_ready = 1;
    }
}

void stm32_bluetooth_service(uint64_t now) {
    if (!bluetooth.ready)
        return;

    uint32_t irq_flags = arch_irq_save();
    stm32_bluetooth_irq();
    arch_irq_restore(irq_flags);

    int module_present = bluetooth.detected || bluetooth.at_responsive;
    int state_high = module_present &&
        !!(GPIOA_IDR & (1U << BLUETOOTH_STATE_PIN));
    if (state_high != bluetooth_state_high) {
        bluetooth_state_high = state_high;
        bluetooth_state_changed_time = now;
    } else if (state_high && !bluetooth.connected &&
               now - bluetooth_state_changed_time >=
                   BLUETOOTH_CONNECT_ASSERT_MS) {
        bluetooth.connected = 1;
    } else if (!state_high && bluetooth.connected &&
               now - bluetooth_state_changed_time >=
                   BLUETOOTH_DISCONNECT_ASSERT_MS) {
        bluetooth.connected = 0;
    }
    bluetooth.waiting =
        bluetooth.slave_mode && bluetooth.discoverable &&
        bluetooth.name_configured && bluetooth.pin_configured &&
        bluetooth.reset_performed && !bluetooth.connected;

    if (bluetooth_observed_rx != bluetooth.received_bytes) {
        bluetooth_observed_rx = bluetooth.received_bytes;
        bluetooth_last_rx_time = now;
    } else if (bluetooth_rx_head != bluetooth_rx_tail &&
               now - bluetooth_last_rx_time >= BLUETOOTH_FRAME_IDLE_MS) {
        bluetooth_frame_ready = 1;
    }
}

int stm32_bluetooth_connected(void) {
    return bluetooth.ready && bluetooth.connected;
}

int stm32_bluetooth_send(const void *data, size_t length) {
#ifndef CONFIG_STM32_XUANWU
    (void)data;
    (void)length;
    return -1;
#else
    if (!bluetooth.ready || !bluetooth.connected || (!data && length))
        return -1;

    const uint8_t *bytes = data;
    for (size_t i = 0; i < length; i++) {
        if (bluetooth_uart_send_byte(bytes[i]) != 0)
            return -1;
    }
    if (stm32_uart_wait_tx_complete(
            BLUETOOTH_UART, BLUETOOTH_TX_TIMEOUT) != 0)
        return -1;
    bluetooth.transmitted_bytes += (uint32_t)length;
    return 0;
#endif
}

int stm32_bluetooth_send_text(const char *text) {
    if (!text)
        return -1;
    size_t length = 0;
    while (text[length])
        length++;
    return stm32_bluetooth_send(text, length);
}

